
export const floors = [
    {
        name: "الدور الاول (1)",
        employees: [],
        offices: ["G118-G119", "G120", "G117", "G121", "G106", "G107", "G109-G108", "G110", "G111"]
    },
    {
        name: "الدور الثاني (1)",
        employees: ["F105", "F104", "F103", "F102", "F101", "F100", "F107", "F108", "F109",
            "F111", "F112", "F113", "F114", "F115", "F116", "F117"],
        offices: ["F099", "F118"]
    },
    {
        name: "الدور الثاني (2)",
        employees: ["F094", "F093", "F092", "F091", "F090", "F089", "F077", "F078", "F080",
            "F081", "F082"],
        offices: ["F095", "F076", "F088", "F083"]
    },
    {
        name: "الدور الثالث (علوم1)",
        employees: ["S116", "S115", "S114", "S113", "S112", "S111", "S119", "S120", "S121",
            "S122", "S123", "S124", "S125", "S126", "S127", "S128"],
        offices: ["S110", "S129"]
    },
    {
        name: "الدور الثالث (علوم2)",
        employees: ["S100", "S101", "S102", "S103", "S104", "S105", "S106", "S090", "S091", "S092", "S093"],
        offices: ["S099", "S096", "S089"]
    },
    {
        name: "الدور الرابع (ادارة1)",
        employees: ["T114", "T115", "T116", "T117", "T118", "T119", "T121", "T122", "T123", "T125",
            "T126", "T127", "T128", "T129"],
        offices: ["T113", "T132", "T130", "T131"]
    },
    {
        name: "الدور الرابع (نظم2)",
        employees: ["T102", "T103", "T104", "T105", "T089", "T106", "T107", "T090", "T091", "T092", "T093"],
        offices: ["T101", "T108", "T096", "T094", "T095"]
    }
]

export const offices = [
    {
        name: "مركز الأبحاث",
        code: "G118-G119",
    },
    {
        name: "علاقات عامة",
        code: "G117",

    },
    {
        name: "زائرات الكلية",
        code: "G121",

    },
    {
        name: "معمل",
        code: "G106",

    },
    {
        name: "النادي العلمي",
        code: "G107",

    },
    {
        name: "قاعة اجتماعات كلية علوم الحاسب والمعلومات",
        code: "G109-G108",

    },
    {
        name: "أعضاء تدريس إدارة",
        code: "G110",

    },
    {
        name: "الجودة",
        code: "G111",

    },
    {
        name: "وكيلة قسم التقنية ",
        code: "F099",
    },
    {
        name: "اجتماعات قسم التعنية",
        code: "F118",
    },
    {
        name: "مكتبة فسم التقنية",
        code: "F095",

    },
    {
        name: "البحث العلمي",
        code: "F076",

    },
    {
        name: "مكتب التصوير",
        code: "F088",

    },
    {
        name: "وحدة التصوير",
        code: "F083",

    },
    {
        name: "مكتبة ادارة المعلومات",
        code: "S110"
    },
    {
        name: "مشاريع ادارة المعلومات",
        code: "S129"
    },
    {
        name: "مكتبة فسم العلوم",
        code: "S089"
    },
    {
        name: "اجتماعات قسم العلوم",
        code: "S099"
    },
    {
        name: "وكيلة قسم العلوم",
        code: "S096"
    },
    {
        name: "سكرتيرة قسم العلوم",
        code: "S095"
    },
    {
        name: "اجتماعات ادارة المعلومات",
        code: "T113"
    },
    {
        name: "وكيلة ادارة المعلومات",
        code: "T132"
    },
    {
        name: "مساعدة ادارة المعلومات",
        code: "T130"
    },
    {
        name: "سكرتيرة ادارة المعلومات",
        code: "T131"
    },
    {
        name: "مكتبة فسم النظم",
        code: "T108"
    },
    {
        name: "قاعة اجتماعات النظم",
        code: "T101"
    },
    {
        name: "وكيلة قسم النظم",
        code: "T096"
    },
    {
        name: "مساعدة قسم النظم",
        code: "T094"
    },
    {
        name: "سكرتيرة فسم النظم",
        code: "T095"
    }
]

export const employees = [
    {
        name: "د. نجود العشبان",
        code: "F105",
        floor: "الدور الثاني(1)"
    },
    {
        name: "جوزاء+ايمان",
        code: "F104",
        floor: "الدور الثاني(1)"

    },
    {
        name: "حنان الوادي",
        code: "F103",
        floor: "الدور الثاني(1)"

    },
    {
        name: "نوره الغامدي + ذهب البحيري",
        code: "F102",
        floor: "الدور الثاني(1)"

    },
    {
        name: "ريم عسيري",
        code: "F101",
        floor: "الدور الثاني(1)"

    },
    {
        name: "سكرتيرة قسم التعنية",
        code: "F100",
        floor: "الدور الثاني(1)"

    },
    {
        name: "عبير العريني + ساره العيد",
        code: "F107",
        floor: "الدور الثاني(1)"

    },
    {
        name: "امل الغفيص + الجوهره اليوسف",
        code: "F108",
        floor: "الدور الثاني(1)"

    },
    {
        name: "لجين العواد نوف الدوسري",
        code: "F109",
        floor: "الدور الثاني(1)"

    },
    {
        name: "وتين + شدد",
        code: "F111",
        floor: "الدور الثاني(1)"

    },
    {
        name: "وكيلة قسم التقنية",
        code: "F099",
        floor: "الدور الثاني(1)"

    },
    {
        name: "اجتماعات قسم التعنية ",
        code: "F118",
        floor: "الدور الثاني(1)"

    },
    {
        name: "نفلاء الرميان",
        code: "F112",
        floor: "الدور الثاني(1)"

    },
    {
        name: "سمر العيسي",
        code: "F113",
        floor: "الدور الثاني(1)"

    },
    {
        name: "فاطمة + شموخ",
        code: "F114",
        floor: "الدور الثاني(1)"

    }, {
        name: "خولة+انتصار",
        code: "F115",
        floor: "الدور الثاني(1)"

    },
    {
        name: "شذا الخالدي",
        code: "F116",
        floor: "الدور الثاني(1)"

    },
    {
        name: "ملاك العتيق",
        code: "F117",
        floor: "الدور الثاني(1)"

    }, {
        name: "نجلاء الحسون",
        code: "F093",
        floor: "الدور الثاني(2)"
    },
    {
        name: "سارة الراشد",
        code: "F092",
        floor: "الدور الثاني(2)"

    }, {
        name: "هيفاء الحسيني",
        code: "F091",
        floor: "الدور الثاني(2)"

    },
    {
        name: "نوف + ندي",
        code: "F090",
        floor: "الدور الثاني(2)"

    },
    {
        name: "د نهى الشقيران",
        code: "F089",
        floor: "الدور الثاني(2)"

    },
    {
        name: "هند + فاطمة ",
        code: "F077",
        floor: "الدور الثاني(2)"

    },
    {
        name: "شذى + بشائر",
        code: "F078",
        floor: "الدور الثاني(2)"

    },
    {
        name: "عبير + سارة",
        code: "F080",
        floor: "الدور الثاني(2)"

    },
    {
        name: "وضحى المحامض",
        code: "F081",
        floor: "الدور الثاني(2)"

    },
    {
        name: "رحمة الأحمري",
        code: "F082",
        floor: "الدور الثاني(2)"

    },
    {
        name: "د.ايمان الزيد ",
        code: "S116",
        floor: "الدور الثالث(علوم1)"
    },
    {
        name: "سارة الحمزد",
        code: "S115",
        floor: "الدور الثالث(علوم1)"

    },
    {
        name: "د.امل السيف",
        code: "S114",
        floor: "الدور الثالث(علوم1)"

    }, {
        name: "ولاء الصرامي",
        code: "S113",
        floor: "الدور الثالث(علوم1)"

    },
    {
        name: "امجاد العمرو",
        code: "S112",
        floor: "الدور الثالث(علوم1)"

    },
    {
        name: "حياة المسلم",
        code: "S111",
        floor: "الدور الثالث(علوم1)"

    },
    {
        name: "د.دلال الضويلع",
        code: "S119",
        floor: "الدور الثالث(علوم1)"

    },
    {
        name: "د.اسماء الصالح",
        code: "S120",
        floor: "الدور الثالث(علوم1)"

    },
    {
        name: "د.هيفاء بن قاسم",
        code: "S121",
        floor: "الدور الثالث(علوم1)"

    },
    {
        name: "منيرة الشبل",
        code: "S122",
        floor: "الدور الثالث(علوم1)"

    },
    {
        name: "د.ارام السدراني",
        code: "S123",
        floor: "الدور الثالث(علوم1)"

    },
    {
        name: "بسمة الصولي",
        code: "S124",
        floor: "الدور الثالث(علوم1)"

    },
    {
        name: "د.بسمة الثاني",
        code: "S125",
        floor: "الدور الثالث(علوم1)"

    },
    {
        name: "د.تهاني البلوي",
        code: "S126",
        floor: "الدور الثالث(علوم1)"

    },
    {
        name: "دانية العمر",
        code: "S127",
        floor: "الدور الثالث(علوم1)"

    },
    {
        name: "عريب العويشق",
        code: "S128",
        floor: "الدور الثالث(علوم1)"

    },
    {
        name: "زهراء حريان ",
        code: "S105",
        floor: "الدور الثالث(علوم2)"
    },
    {
        name: "د. عبير النفجان ",
        code: "S104",
        floor: "الدور الثالث(علوم2)"

    },
    {
        name: "د.مها الربيعة ",
        code: "S103",
        floor: "الدور الثالث(علوم2)"

    },
    {
        name: "غادة العصيمي ",
        code: "S102",
        floor: "الدور الثالث(علوم2)"

    },
    {
        name: "د.وعد الحوشان ",
        code: "S101",
        floor: "الدور الثالث(علوم2)"

    },
    {
        name: "د لميس الهزاع",
        code: "S100",
        floor: "الدور الثالث(علوم2)"

    }, {
        name: "	د.مزنة المطيري",
        code: "S090",
        floor: "الدور الثالث(علوم2)"

    },
    {
        name: "د.وجدان بن سعيدان",
        code: "S091",
        floor: "الدور الثالث(علوم2)"

    },
    {
        name: "	د.منال السبهان ",
        code: "S093",
        floor: "الدور الثالث(علوم2)"

    },
    {
        name: "د.منال المسلم ",
        code: "S092",
        floor: "الدور الثالث(علوم2)"

    },
    {
        name: "د لولوة السويدان",
        code: "T119",
        floor: "الدور الرابع(ادارة1)"
    },
    {
        name: "د أمل العمران ",
        code: "T118",
        floor: "الدور الرابع(ادارة1)"

    },
    {
        name: "د. عليا السليمي",
        code: "T117",
        floor: "الدور الرابع(ادارة1)"

    },
    {
        name: "د.موضي الدبيان ",
        code: "T116",
        floor: "الدور الرابع(ادارة1)"

    },
    {
        name: "أد.مها الخثعمي",
        code: "T115",
        floor: "الدور الرابع(ادارة1)"

    },
    {
        name: "د.ريمية العتيبي",
        code: "T114",
        floor: "الدور الرابع(ادارة1)"

    },
    {
        name: "د.مريم العوشن",
        code: "T121",
        floor: "الدور الرابع(ادارة1)"

    },
    {
        name: " 	د.منى الغانم",
        code: "T122",
        floor: "الدور الرابع(ادارة1)"

    },
    {
        name: "د.نوف الشريف",
        code: "T123",
        floor: "الدور الرابع(ادارة1)"

    },
    {
        name: "د.العنود السالم ",
        code: "T125",
        floor: "الدور الرابع(ادارة1)"

    },
    {
        name: "د.أريج العسكر",
        code: "T126",
        floor: "الدور الرابع(ادارة1)"

    },
    {
        name: "د.إعتماد مؤمنة ",
        code: "T127",
        floor: "الدور الرابع(ادارة1)"

    },
    {
        name: "د. هند عافية ",
        code: "T128",
        floor: "الدور الرابع(ادارة1)"

    },
    {
        name: "د.امل السالم",
        code: "T129",
        floor: "الدور الرابع(ادارة1)"

    },
    {
        name: "د.عبير الحربي",
        code: "T107",
        floor: "الدور الرابع(نظم2)"
    },
    {
        name: "د.ايات عقمان",
        code: "T106",
        floor: "الدور الرابع(نظم2)"

    },
    {
        name: "د.مني الخطابي",
        code: "T105",
        floor: "الدور الرابع(نظم2)"

    },
    {
        name: "د.ميسون الدخيل",
        code: "T104",
        floor: "الدور الرابع(نظم2)"

    },
    {
        name: "د.لجين الدهش",
        code: "T103",
        floor: "الدور الرابع(نظم2)"

    },
    {
        name: "د.موضي ال شيخ",
        code: "T102",
        floor: "الدور الرابع(نظم2)"

    }, {
        name: "الهنوف السويلم",
        code: "T089",
        floor: "الدور الرابع(نظم2)"

    },
    {
        name: "د. عبير السند",
        code: "T090",
        floor: "الدور الرابع(نظم2)"

    },
    {
        name: "د. هلا الرميح",
        code: "T091",
        floor: "الدور الرابع(نظم2)"

    }, {
        name: "د. هالة ال شيخ",
        code: "T092",
        floor: "الدور الرابع(نظم2)"

    },
    {
        name: "د. هياء الحقباني",
        code: "T093",
        floor: "الدور الرابع(نظم2)"

    }
]



